announcements/preview-acss-math.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-08 Wed 15:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Audio Deja Vu: Audio Formatted Math On The Emacspeak Desktop</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Audio Deja Vu: Audio Formatted Math On The Emacspeak Desktop</h1>
<div id="outline-container-org4f916ed" class="outline-2">
<h2 id="org4f916ed"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
This article previews a new feature in the next Emacspeak release &#x2014;
audio-formatted Mathematics using Aural CSS. <a href="http://www.cs.bham.ac.uk/~vxs">Prof. Volker Sorge</a> worked
at Google as a Visiting Scientist from Sep 2012 to August 2013, when
we implemented <a href="https://www.youtube.com/watch?v=YyWu9HB9QtU">math
access in ChromeVox</a> &#x2014; see <a href="http://allthingsd.com/20130604/t-v-ramans-audio-deja-vu-from-google-a-math-reading-system-for-the-web/">this brief overview</a>. Since leaving
Google, Volker has refactored and extended his work to create an Open
Source <a href="https://github.com/zorkow/speech-rule-engine.git%20(push">Speech-Rule-Engine</a> implemented using NodeJS. This
speech-rule-engine can be used in many different environments;
Emacspeak leverages that work to enable audio-formatting and
interactive browsing of math content.
</p>
</div>
</div>


<div id="outline-container-org644ab06" class="outline-2">
<h2 id="org644ab06"><span class="section-number-2">2</span> Overview Of Functionality</h2>
<div class="outline-text-2" id="text-2">
<p>
Math access on the Emacspeak desktop is implemented via module
<a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-maths.el#L558">emacspeak-maths.el</a> &#x2014; see <a href="https://github.com/tvraman/emacspeak/blob/master/js/node/Readme.org#L40">js/node/Readme.org</a> in the Emacspeak GitHub
repository for setup instructions. 
</p>

<p>
Once loaded, module <code>emacspeak-maths</code> provides a <i>Math Navigator</i> that
implements the user interface for sending Math expressions to the
Speech-Rule-Engine, and for interactively browsing the resulting
structure. At each step of the interaction, Emacspeak receives math
expressions that have been annotated with Aural CSS and produces
audio-formatted output. The audio-formatted text can itself be
navigated in a special <i><b>Spoken Math</b></i> emacs buffer.
</p>

<p>
Module <code>emacspeak-maths.el</code> implements various affordances for
dispatching mathematical content to the Speech-Rule-Engine &#x2014; see
usage examples in the next section.
</p>
</div>
</div>

<div id="outline-container-orgd58e329" class="outline-2">
<h2 id="orgd58e329"><span class="section-number-2">3</span> Usage Examples</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org37f7c26" class="outline-3">
<h3 id="org37f7c26"><span class="section-number-3">3.1</span> The Emacspeak Maths Navigator</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>The <i>maths navigator</i> can be invoked by pressing <span class="underline">S-SPC</span> (hold
down Windows key and press SPC).</li>
<li>Once invoked, the /Maths Navigator can be used to enter an
expression to read.</li>
<li>Pressing <span class="underline">SPC</span> again prompts for the La)TeX expression.</li>
<li>Pressing  <span class="underline">&lt;RET&gt;</span> guesses the expression to read from the current context.</li>
<li>The arrow keys navigate the expression being read.</li>
<li>Pressing <span class="underline">o</span> switches to the <i><b>Spoken Math</b></i> buffer and exits the
navigator.</li>
</ul>

<p>
See the <a href="http://tvraman.github.io/emacspeak/manual/emacspeak_002dmaths.html#emacspeak_002dmaths">relevant chapter</a> in the online Emacspeak manual for details.
</p>
</div>
</div>

<div id="outline-container-org31989db" class="outline-3">
<h3 id="org31989db"><span class="section-number-3">3.2</span> Math Content In La)TeX Documents</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Open a La)TeX document containing math content.</li>
<li>Move point to a line containing   mathematical markup.</li>
<li>Press <span class="underline">&lt;S-SPC&gt;</span> &lt;RET&gt; to have that expression audio-formatted.</li>
<li>Use arrow keys to navigate the resulting structure.</li>
<li>Press any other key to exit the navigator.</li>
</ol>
</div>
</div>

<div id="outline-container-orge88bd48" class="outline-3">
<h3 id="orge88bd48"><span class="section-number-3">3.3</span> Math Content On Wikipedia</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>Open a Wikipedia page in the Emacs Web Wowser (EWW)that has
mathematical content.</li>
<li>Wikipedia displays math as images, with the alt-text giving the
La)TeX representation.</li>
<li>Navigate to some math content on the page, then press <span class="underline">&lt;S-SPC&gt;
&lt;a&gt; to speak that content &#x2014; _a</span> is for alt.</li>
</ol>
<p>
+-
</p>
<ol class="org-ol">
<li>As an example, navigate to</li>
</ol>
<p>
<a href="https://en.wikipedia.org/wiki/Derangement">Wikipedia Math Example</a>, locate math expressions on that page, then
press <span class="underline">&lt;S-SPC a&gt;</span>.
</p>
</div>
</div>

<div id="outline-container-org81231e6" class="outline-3">
<h3 id="org81231e6"><span class="section-number-3">3.4</span> Math Content From The Emacs Calculator</h3>
<div class="outline-text-3" id="text-3-4">
<ol class="org-ol">
<li>The built-in Emacs Calculator (<code>calc</code>) provides  many complex
math functions including symbolic algebra.</li>
<li>For my personal <code>calc</code> setup, see  <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/calc-prepare.el#L25">tvr/calc-prepare.el</a> in the
Emacspeak GitHub repo.</li>
<li>This setting below sets up the Emacs Calculator to output results
as La)TeX: <span class="underline">(setq calc-language 'tex)</span></li>
<li>With the above setting in effect, launch the emacs Calculator by
pressing <span class="underline">M-##</span>.</li>
<li>Press <span class="underline">'</span> and enter <code>sin(x)</code> &#x2014; this uses algebraic mode.</li>
<li>Press <span class="underline">a t</span> to get the Taylor series expansion of the above
expression, and press <span class="underline">x</span> when prompted for the variable.</li>
<li>This displays the Taylor Series expansion up to the desired
number of terms &#x2014; try <span class="underline">7</span> terms.</li>
<li>Now, with Calc having shown the results as TeX, press <span class="underline">&lt;S-SPC&gt;</span>
<span class="underline">&lt;RET&gt;</span> to browse this expression using the <i>Maths Navigator</i>.</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-org6a7e2c6" class="outline-2">
<h2 id="org6a7e2c6"><span class="section-number-2">4</span> And The Best Is Yet To Come</h2>
<div class="outline-text-2" id="text-4">
<p>
This is intentionally called an <i>early preview</i> because there is still
much that can be improved:
</p>

<ol class="org-ol">
<li>Enhance the rule engine to infer and convey more semantics.</li>
<li>Improved audio formatting rules to better present the available information.</li>
<li>Update/tune the use of Aural CSS properties to best leverage
today's TTS engines.</li>
<li>Integrate math-reading functionality into more usage contexts in
addition to the ones enumerated in this article.</li>
</ol>
</div>
</div>


<div id="outline-container-org6ad2847" class="outline-2">
<h2 id="org6ad2847"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=YyWu9HB9QtU">Youtube Video from early 2013 demonstrating Math Access in Chrome</a></li>
<li><a href="http://allthingsd.com/20130604/t-v-ramans-audio-deja-vu-from-google-a-math-reading-system-for-the-web/">AllThings Digital</a>  outlining math access &#x2014; published May 2013.</li>
<li><a href="https://github.com/zorkow/emacs-math-speak/blob/master/paper/assets16.tex">Assets 2016</a> publication describing this work.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-02-08 Wed 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2017-02-08 Wed 15:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
